app/Helpers/helpers.php

function sideMenu($role_id)
{
    $parent = DB::table('menus')
        ->select(DB::raw('menus.id, menus.name, menus.menu_url, menus.parent_id, menus.icon'))
        ->join('permissions', 'permissions.menu_id', '=', 'menus.id')
        ->where('permissions.role_id', $role_id)
        ->orderBy('menus.president', 'ASC')
        ->where('menus.parent_id', 0)
        ->get();
---
select menus.id, menus.name, menus.menu_url, menus.parent_id, menus.icon from `menus` inner join `permissions` on `permissions`.`menu_id` = `menus`.`id` where `permissions`.`role_id` = 1 and `menus`.`parent_id` = 0 order by `menus`.`president` asc

function subMenu($role_id, $id)
{

    return DB::table('menus')
        ->select(DB::raw('menus.id, menus.name, menus.menu_url, menus.parent_id, menus.icon'))
        ->join('permissions', 'permissions.menu_id', '=', 'menus.id')
        ->where('permissions.role_id', $role_id)
        ->where('menus.parent_id', '=', $id)
        ->orderBy('president', 'ASC')
        ->get()->toArray();
---
select menus.id, menus.name, menus.menu_url, menus.parent_id, menus.icon from `menus` inner join `permissions` on `permissions`.`menu_id` = `menus`.`id` where `permissions`.`role_id` = 1 and `menus`.`parent_id` = 1 order by `president` asc

function facebookChat()
{
    return cache()->remember('facebook-setting', 43000, function () {
        return App\Model\Setting\Messenger::orderBy('id', 'desc')->first();
---
select * from `messengers` order by `id` desc limit 1

function googleAnalytics()
{
    return cache()->remember('google-setting', 43000, function () {
        return App\Model\Setting\GoogleAnalytic::orderBy('id', 'desc')->first();
---
select * from `google_analytics` order by `id` desc limit 1

function frontCategory()
{

    return cache()->remember('all-category', 43000, function () {
        return App\Model\Category::select('id', 'category_name', 'category_native_name', 'icon')
            ->with('sub_category.sub_sub_category')
            ->where('status', '=', 1)
            ->get();
---
select * from `sub_categories` where `sub_categories`.`category_id` in (11, 12, 13, 14, 15, 16, 17, 18)

function getCurrentCurrency()
{
    return cache()->remember('currency', 43000, function () {

        return App\Model\Currency::where('currency_status', 1)->first();
---
select * from `currency` where `currency_status` = 1 limit 1

function homeSlider()
{
    return cache()->remember('home-slider', 43000, function () {
        return Slider::where('status', '=', AllStatic::$active)->orderBy('updated_at', 'desc')->get();
---
select * from `sliders` where `status` = 1 order by `updated_at` desc

function codeCheker()
{
    return $check = InstalltionSetting::orderBy('id', 'desc')->first();
---
select * from `installtion_settings` order by `id` desc limit 1