app/Http/Controllers/Chart/ReportController.php

select count(orders.id) as total_order, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date from `orders` left join (SELECT order_id, sum(quantity) as total_sold_qty, sum(total_buying_price) as total_buying_price, sum(total_selling_price) as total_selling_price from `order_details` group by order_id ) tem_order_details  on `orders`.`id` = `tem_order_details`.`order_id` where `order_date` between '2022-06-01' and '2022-06-10' group by `orders`.`order_date` limit 10 offset 0
select * from `users` where `users`.`id` in (12, 14)
select orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date from `orders` left join (SELECT order_id, sum(quantity) as total_sold_qty, sum(total_buying_price) as total_buying_price, sum(total_selling_price) as total_selling_price from `order_details` group by order_id ) tem_order_details  on `orders`.`id` = `tem_order_details`.`order_id` where `order_date` between '2022-05-22' and '2022-05-22' group by `orders`.`id` limit 10 offset 0
---
                    function ($join) {
                        $join->on('orders.id', '=', 'tem_order_details.order_id');
                    })
                    ->select(\DB::raw("orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date"))
                    ->groupBy('orders.id');
        }

        if ($request->range != '') {
            $date  = $request->range;
            $data  = explode(",", $date);
            $start = date("Y-m-d", strtotime(date_convert($data[0])));
            $end   = date("Y-m-d", strtotime(date_convert($data[1])));
            $order->whereBetween('order_date', [$start, $end]);
        }

        if ($request->city != 'undefined') {
            $order->where('shipping_area_id', '=', $request->city);
        }

        if (isset($request->customer) && $request->customer != 'undefined') {
            $order->where('user_id', '=', $request->customer);
        }

        return $order = $order->paginate(10);

select * from `users` where `users`.`id` in (12, 14)
select orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date from `orders` left join (SELECT order_id, sum(quantity) as total_sold_qty, sum(total_buying_price) as total_buying_price, sum(total_selling_price) as total_selling_price from `order_details` group by order_id ) tem_order_details  on `orders`.`id` = `tem_order_details`.`order_id` where `user_id` is null group by `orders`.`id`
---
                    function ($join) {
                        $join->on('orders.id', '=', 'tem_order_details.order_id');
                    })
                    ->select(\DB::raw("orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date"))
                    ->groupBy('orders.id');
        }

        if ($request->range != '') {
            $date  = $request->range;
            $data  = explode(",", $date);
            $start = date("Y-m-d", strtotime(date_convert($data[0])));
            $end   = date("Y-m-d", strtotime(date_convert($data[1])));
            $order->whereBetween('order_date', [$start, $end]);
        }
        if ($request->city != 'undefined') {
            $order->where('shipping_area_id', '=', $request->city);
        }
        if (isset($request->customer) && $request->customer != 'undefined') {
            $order->where('user_id', '=', $request->customer);
        }
        $order = $order->get();

select * from `users` where `users`.`id` in (12, 14)
select orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date from `orders` left join (SELECT order_id, sum(quantity) as total_sold_qty, sum(total_buying_price) as total_buying_price, sum(total_selling_price) as total_selling_price from `order_details` group by order_id ) tem_order_details  on `orders`.`id` = `tem_order_details`.`order_id` group by `orders`.`id`
---
                    function ($join) {
                        $join->on('orders.id', '=', 'tem_order_details.order_id');
                    })
                    ->select(\DB::raw("orders.id as order_id, orders.user_id, tem_order_details.total_sold_qty, tem_order_details.total_buying_price, tem_order_details.total_selling_price, DATE_FORMAT(orders.order_date,'%d-%m-%y') as order_date"))
                    ->groupBy('orders.id');
        }

        if ($request->range != '') {
            $date  = $request->range;
            $data  = explode(",", $date);
            $start = date("Y-m-d", strtotime(date_convert($data[0])));
            $end   = date("Y-m-d", strtotime(date_convert($data[1])));

            $order->whereBetween('order_date', [$start, $end]);
        }
        if ($request->city != 'undefined') {
            $order->where('shipping_area_id', '=', $request->city);
        }
        if (isset($request->customer) && $request->customer != 'undefined') {
            $order->where('user_id', '=', $request->customer);
        }
        $order = $order->get();